intents = {
    "greeting": ["hi", "hello", "hey"],
    "admission": ["admission", "apply", "join"],
    "fees": ["fees", "fee", "cost", "payment"],
    "courses": ["course", "courses", "program"],
    "bye": ["bye", "exit", "goodbye"]
}

responses = {
    "greeting": {
        "en": ["Hello! How can I help you?", "Hi! Ask me anything."],
        "ta": ["வணக்கம்! நான் எப்படி உதவலாம்?"],
        "hi": ["नमस्ते! मैं आपकी कैसे मदद कर सकता हूँ?"]
    },
    "admission": {
        "en": ["Admissions are open now."],
        "ta": ["சேர்க்கை தற்போது திறந்துள்ளது."],
        "hi": ["प्रवेश अभी खुले हैं।"]
    },
    "fees": {
        "en": ["Fees depend on the course."],
        "ta": ["கட்டணம் பாடத்திட்டத்தைப் பொறுத்தது."],
        "hi": ["फीस कोर्स पर निर्भर करती है।"]
    },
    "courses": {
        "en": ["We offer Engineering, Science, and Arts."],
        "ta": ["எஞ்சினியரிங், சயின்ஸ் மற்றும் ஆர்ட்ஸ் பாடநெறிகள் உள்ளன."],
        "hi": ["हम इंजीनियरिंग, साइंस और आर्ट्स प्रदान करते हैं।"]
    },
    "bye": {
        "en": ["Goodbye!"],
        "ta": ["பிரியாவிடை!"],
        "hi": ["अलविदा!"]
    }
}

sentiment_words = {
    "sad": ["sad", "depressed", "upset", "tired", "angry"]
}

translations = {
    "en": {
        "support": "I’m here for you. Don’t worry, everything will be okay 💙",
        "fallback": "I don’t have that info yet. Please ask something else."
    },
    "ta": {
        "support": "நான் உங்களுடன் இருக்கிறேன். கவலைப்பட வேண்டாம் 💙",
        "fallback": "இந்த தகவல் இன்னும் இல்லை."
    },
    "hi": {
        "support": "मैं आपके साथ हूँ, चिंता मत करें 💙",
        "fallback": "मुझे इस बारे में जानकारी नहीं है।"
    }
}
